In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.rcParams["figure.figsize"] = (20,10)

In [2]:
df = pd.read_csv('C:\\Personal\\Projects\\Datasets\\Bengaluru_House_Price\\Bengaluru_House_Data.csv')
df.head(10)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
5,Super built-up Area,Ready To Move,Whitefield,2 BHK,DuenaTa,1170,2.0,1.0,38.00
6,Super built-up Area,18-May,Old Airport Road,4 BHK,Jaades,2732,4.0,NaN,204.00
7,Super built-up Area,Ready To Move,Rajaji Nagar,4 BHK,Brway G,3300,4.0,NaN,600.00
8,Super built-up Area,Ready To Move,Marathahalli,3 BHK,NaN,1310,3.0,1.0,63.25
9,Plot Area,Ready To Move,Gandhi Bazar,6 Bedroom,NaN,1020,6.0,NaN,370.00

In [3]:
df.shape

(13320, 9)

In [4]:
df.groupby(['area_type','size'])['area_type'].agg('count')

area_type             size
Built-up  Area        1 BHK         114
                      1 Bedroom      35
                      1 RK            4
                      10 Bedroom      1
                      2 BHK         969
                                   ...
Super built-up  Area  5 BHK          46
                      6 BHK          20
                      7 BHK          13
                      8 BHK           3
                      9 BHK           5
Name: area_type, Length: 63, dtype: int64

In [5]:
# Removed unwanted features
df2 =  df.drop(['area_type','availability','society'], axis = 'columns')
df2.head(6)

                   location       size total_sqft  bath  balcony   price
0  Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00
2               Uttarahalli      3 BHK       1440   2.0      3.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00
4                  Kothanur      2 BHK       1200   2.0      1.0   51.00
5                Whitefield      2 BHK       1170   2.0      1.0   38.00

In [6]:
df2.isnull().sum()

location        1
size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

In [7]:
# After dropping null values
df3 = df2.dropna()
df3.head(10)

                    location       size total_sqft  bath  balcony   price
0   Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07
1           Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00
2                Uttarahalli      3 BHK       1440   2.0      3.0   62.00
3         Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00
4                   Kothanur      2 BHK       1200   2.0      1.0   51.00
5                 Whitefield      2 BHK       1170   2.0      1.0   38.00
8               Marathahalli      3 BHK       1310   3.0      1.0   63.25
10                Whitefield      3 BHK       1800   2.0      2.0   70.00
11                Whitefield  4 Bedroom       2785   5.0      3.0  295.00
12        7th Phase JP Nagar      2 BHK       1000   2.0      1.0   38.00

In [8]:
df3.shape

(12710, 6)

In [9]:
df3.isna().sum()

location      0
size          0
total_sqft    0
bath          0
balcony       0
price         0
dtype: int64

In [10]:
df3['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '3 Bedroom', '1 BHK', '1 RK',
       '4 BHK', '1 Bedroom', '2 Bedroom', '6 Bedroom', '8 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '11 Bedroom', '43 Bedroom',
       '14 BHK', '8 BHK', '12 Bedroom', '10 Bedroom', '13 BHK'],
      dtype=object)

In [11]:
df3['BHK'] = df3['size'].apply(lambda x: int(x.split(' ')[0]))

C:\Users\HrithikKumarP\AppData\Local\Temp\ipykernel_48940\3303903377.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['BHK'] = df3['size'].apply(lambda x: int(x.split(' ')[0]))

In [12]:
df3.head()

                   location       size total_sqft  bath  balcony   price  BHK
0  Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0      3.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0      1.0   51.00    2

In [13]:
# Replacing BHK column for size feature
df4 = df3.drop('size',axis='columns')
df4.head()

                   location total_sqft  bath  balcony   price  BHK
0  Electronic City Phase II       1056   2.0      1.0   39.07    2
1          Chikka Tirupathi       2600   5.0      3.0  120.00    4
2               Uttarahalli       1440   2.0      3.0   62.00    3
3        Lingadheeranahalli       1521   3.0      1.0   95.00    3
4                  Kothanur       1200   2.0      1.0   51.00    2

In [14]:
df4[df4.BHK<=3]

                       location total_sqft  bath  balcony   price  BHK
0      Electronic City Phase II       1056   2.0      1.0   39.07    2
2                   Uttarahalli       1440   2.0      3.0   62.00    3
3            Lingadheeranahalli       1521   3.0      1.0   95.00    3
4                      Kothanur       1200   2.0      1.0   51.00    2
5                    Whitefield       1170   2.0      1.0   38.00    2
...                         ...        ...   ...      ...     ...  ...
13312                 Bellandur       1262   2.0      2.0   47.00    2
13313               Uttarahalli       1345   2.0      1.0   57.00    3
13314         Green Glen Layout       1715   3.0      3.0  112.00    3
13317     Raja Rajeshwari Nagar       1141   2.0      1.0   60.00    2
13319              Doddathoguru        550   1.0      1.0   17.00    1

[10783 rows x 6 columns]

In [15]:
df4['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      shape=(1976,), dtype=object)

In [16]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [17]:
df4[~df4.total_sqft.apply(lambda x: is_float(x))].head()

               location   total_sqft  bath  balcony    price  BHK
30            Yelahanka  2100 - 2850   4.0      0.0  186.000    4
122              Hebbal  3067 - 8156   4.0      0.0  477.000    4
137  8th Phase JP Nagar  1042 - 1105   2.0      0.0   54.005    2
165            Sarjapur  1145 - 1340   2.0      0.0   43.490    2
188            KR Puram  1015 - 1540   2.0      0.0   56.800    2

In [26]:
def convert_sqft_into_nums(x):
    x_split = x.split('-')
    if len(x_split) == 2:
        return float(float(x_split[0]) + float(x_split[1]))/2
    try:
        return float(x)
    except:
        return None

In [27]:
df4['total_sqft'] = df4['total_sqft'].apply(convert_sqft_into_nums)
df4.head()

                   location  total_sqft  bath  balcony   price  BHK
0  Electronic City Phase II      1056.0   2.0      1.0   39.07    2
1          Chikka Tirupathi      2600.0   5.0      3.0  120.00    4
2               Uttarahalli      1440.0   2.0      3.0   62.00    3
3        Lingadheeranahalli      1521.0   3.0      1.0   95.00    3
4                  Kothanur      1200.0   2.0      1.0   51.00    2

In [28]:
df4[~df4.total_sqft.apply(lambda x: is_float(x))].head()

Empty DataFrame
Columns: [location, total_sqft, bath, balcony, price, BHK]
Index: []